<a href="https://colab.research.google.com/github/junio-firmino/Aprendizado_python/blob/master/brend.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
brend_url = '/content/drive/MyDrive/BrentOilPrices.csv'

In [3]:
brend = pd.read_csv(brend_url)

In [4]:
brend_1 = pd.read_csv(brend_url,index_col=0,parse_dates=True)

In [5]:
brend_1

            Price
Date
2000-01-04  23.95
2000-01-05  23.72
2000-01-06  23.55
2000-01-07  23.35
2000-01-10  22.77
...           ...
2019-09-24  64.13
2019-09-25  62.41
2019-09-26  62.08
2019-09-27  62.48
2019-09-30  60.99

[5016 rows x 1 columns]

In [6]:
brend_1.reset_index(inplace=True)

In [7]:
brend

           Date  Price
0     04-Jan-00  23.95
1     05-Jan-00  23.72
2     06-Jan-00  23.55
3     07-Jan-00  23.35
4     10-Jan-00  22.77
...         ...    ...
5011  24-Sep-19  64.13
5012  25-Sep-19  62.41
5013  26-Sep-19  62.08
5014  27-Sep-19  62.48
5015  30-Sep-19  60.99

[5016 rows x 2 columns]

In [8]:
brend_1

           Date  Price
0    2000-01-04  23.95
1    2000-01-05  23.72
2    2000-01-06  23.55
3    2000-01-07  23.35
4    2000-01-10  22.77
...         ...    ...
5011 2019-09-24  64.13
5012 2019-09-25  62.41
5013 2019-09-26  62.08
5014 2019-09-27  62.48
5015 2019-09-30  60.99

[5016 rows x 2 columns]

In [9]:
brend.dtypes

Date      object
Price    float64
dtype: object

In [10]:
brend.Date

0       04-Jan-00
1       05-Jan-00
2       06-Jan-00
3       07-Jan-00
4       10-Jan-00
          ...
5011    24-Sep-19
5012    25-Sep-19
5013    26-Sep-19
5014    27-Sep-19
5015    30-Sep-19
Name: Date, Length: 5016, dtype: object

In [11]:
brend.Date = brend.Date.astype(np.datetime64)   # Boa tecnica para mudar o tipo da variavel diretamemte

In [12]:
brend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5016 entries, 0 to 5015
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5016 non-null   datetime64[ns]
 1   Price   5016 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 78.5 KB

In [13]:
pd.date_range(start='1/20/2020', periods=10)

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27',
               '2020-01-28', '2020-01-29'],
              dtype='datetime64[ns]', freq='D')

In [14]:
pd.date_range(end='jul 2021', periods=20, freq='W')

DatetimeIndex(['2021-02-14', '2021-02-21', '2021-02-28', '2021-03-07',
               '2021-03-14', '2021-03-21', '2021-03-28', '2021-04-04',
               '2021-04-11', '2021-04-18', '2021-04-25', '2021-05-02',
               '2021-05-09', '2021-05-16', '2021-05-23', '2021-05-30',
               '2021-06-06', '2021-06-13', '2021-06-20', '2021-06-27'],
              dtype='datetime64[ns]', freq='W-SUN')

In [15]:
brend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5016 entries, 0 to 5015
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5016 non-null   datetime64[ns]
 1   Price   5016 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 78.5 KB

In [16]:
brend.set_index(keys='Date', inplace=True)

In [17]:
brend.resample('8H').mean()

                     Price
Date
2000-01-04 00:00:00  23.95
2000-01-04 08:00:00    NaN
2000-01-04 16:00:00    NaN
2000-01-05 00:00:00  23.72
2000-01-05 08:00:00    NaN
...                    ...
2019-09-28 16:00:00    NaN
2019-09-29 00:00:00    NaN
2019-09-29 08:00:00    NaN
2019-09-29 16:00:00    NaN
2019-09-30 00:00:00  60.99

[21628 rows x 1 columns]

In [18]:
brend.head(10)

            Price
Date
2000-01-04  23.95
2000-01-05  23.72
2000-01-06  23.55
2000-01-07  23.35
2000-01-10  22.77
2000-01-11  23.93
2000-01-12  24.62
2000-01-13  24.90
2000-01-14  25.50
2000-01-17  25.99

In [21]:
brend.resample('8H').interpolate(method='spline',order=3)

                         Price
Date
2000-01-04 00:00:00  23.950000
2000-01-04 08:00:00  23.013531
2000-01-04 16:00:00  23.117453
2000-01-05 00:00:00  23.720000
2000-01-05 08:00:00  23.319619
...                        ...
2019-09-28 16:00:00  61.240570
2019-09-29 00:00:00  61.195778
2019-09-29 08:00:00  61.176797
2019-09-29 16:00:00  61.185408
2019-09-30 00:00:00  60.990000

[21628 rows x 1 columns]

In [27]:
brend.asfreq('2D').head(20)

            Price
Date
2000-01-04  23.95
2000-01-06  23.55
2000-01-08    NaN
2000-01-10  22.77
2000-01-12  24.62
2000-01-14  25.50
2000-01-16    NaN
2000-01-18  26.31
2000-01-20  26.26
2000-01-22    NaN
2000-01-24  27.02
2000-01-26  27.18
2000-01-28  26.59
2000-01-30    NaN
2000-02-01  27.35
2000-02-03  27.60
2000-02-05    NaN
2000-02-07  27.94
2000-02-09  27.44
2000-02-11  27.82

In [26]:
brend.head(20)

            Price
Date
2000-01-04  23.95
2000-01-05  23.72
2000-01-06  23.55
2000-01-07  23.35
2000-01-10  22.77
2000-01-11  23.93
2000-01-12  24.62
2000-01-13  24.90
2000-01-14  25.50
2000-01-17  25.99
2000-01-18  26.31
2000-01-19  26.17
2000-01-20  26.26
2000-01-21  27.18
2000-01-24  27.02
2000-01-25  27.24
2000-01-26  27.18
2000-01-27  26.91
2000-01-28  26.59
2000-01-31  27.08

In [28]:
pd.Timestamp('2000-01-24').day_name()

'Monday'

In [30]:
brend.asfreq('10D', method='ffill')

            Price
Date
2000-01-04  23.95
2000-01-14  25.50
2000-01-24  27.02
2000-02-03  27.60
2000-02-13  27.82
...           ...
2019-08-12  57.13
2019-08-22  59.81
2019-09-01  61.04
2019-09-11  63.02
2019-09-21  65.23

[721 rows x 1 columns]

In [31]:
brend.index

DatetimeIndex(['2000-01-04', '2000-01-05', '2000-01-06', '2000-01-07',
               '2000-01-10', '2000-01-11', '2000-01-12', '2000-01-13',
               '2000-01-14', '2000-01-17',
               ...
               '2019-09-17', '2019-09-18', '2019-09-19', '2019-09-20',
               '2019-09-23', '2019-09-24', '2019-09-25', '2019-09-26',
               '2019-09-27', '2019-09-30'],
              dtype='datetime64[ns]', name='Date', length=5016, freq=None)

In [33]:
brend['Quarter'] = brend.index.quarter

In [36]:
brend

            Price  Quarter
Date
2000-01-04  23.95        1
2000-01-05  23.72        1
2000-01-06  23.55        1
2000-01-07  23.35        1
2000-01-10  22.77        1
...           ...      ...
2019-09-24  64.13        3
2019-09-25  62.41        3
2019-09-26  62.08        3
2019-09-27  62.48        3
2019-09-30  60.99        3

[5016 rows x 2 columns]

In [37]:
brend.sample(15)

             Price  Quarter
Date
2013-05-28  103.77        2
2017-10-10   56.62        4
2001-10-17   19.47        4
2010-05-24   69.62        2
2017-12-08   63.86        4
2012-03-26  125.85        1
2004-07-16   38.49        3
2004-07-06   36.47        3
2008-03-31  102.33        1
2009-06-01   66.60        2
2003-09-17   25.76        3
2002-05-27   23.52        2
2016-03-01   35.73        1
2017-03-15   50.63        1
2014-06-09  110.55        2